; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph3 - mode
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star5)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Star6 image0)
	(have_image Phenomenon7 spectrograph2)
	(have_image Star8 image0)
	(have_image Star9 image0)
	(have_image Planet10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Planet12 thermograph1)
	(have_image Star13 spectrograph2)
	(have_image Star14 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 star9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star9)
   goals met: 0 of 10
5. (take_image satellite1 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 1 of 10
6. (turn_to satellite1 star8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star8)
   goals met: 1 of 10
7. (take_image satellite1 star8 instrument2 image0)
   added: (have_image star8 image0)
   goals met: 2 of 10
8. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 2 of 10
9. (turn_to satellite0 star2 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star2)
   goals met: 2 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 10
12. (take_image satellite1 star6 instrument2 image0)
   added: (have_image star6 image0)
   goals met: 3 of 10
13. (turn_to satellite0 phenomenon7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 10
14. (take_image satellite0 phenomenon7 instrument0 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 4 of 10
15. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 4 of 10
16. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 5 of 10
17. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 10
18. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 6 of 10
19. (turn_to satellite0 star11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
20. (take_image satellite0 star11 instrument0 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 7 of 10
21. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 7 of 10
22. (take_image satellite0 star13 instrument0 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 8 of 10
23. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 9 of 10
24. (take_image satellite0 star14 instrument0 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 10 of 10
